[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
4190
12266
4840
11990
17996
18830
20958
12797
18485
9088
17681
5163
13494
21224
3452
6437
1856
15426
11407
16654
19453
4246
17592
19675
4104
1269
17219
8112
5759
17488
17797
20059
7664
16093
2432
15260
15695
5871
8663
11612
17320
14169
2003
3288
4929
13938
20743
9701
8197
17031
14320
15060
11255
9473
17441
12751
8325
11642
9942
14747
14764
5815
3166
14244
1886
9887
15345
3738
8379
15138
19807
14498
14132
18158
14123
3948
12772
2969
10609
16357
11664
13940
20170
17370
5190
18538
19421
9211
7990
3249
7384
4846
2699
3009
882
511
14868
13513
16362
2256
2379
15915
962
17040
8868
634
14346
17280
357
11033
12985
15033
15785
21097
3277
1965
13781
5018
14126
17166
17047
10925
7706
4808
16498
12540
10563
17732
20611
983
12943
13553
1353
19302
4216
19907
11123
17457
15556
19823
11188
4570
7501
2128
3029
6112
11972
11451
18393
19365
15799
8913
18056
192
8122
5808
15462
15898
7523
10789
17186
1847
4779
8715
20544
17083
17624
8649
1457
3061
5332
4718
3424
12721
14091
14812
6353
159
9180
15709
16885
861
16688
2797
9906
20451
4581
3133
17388
10223
6303
3253
1032
19247
1668
10777
15274
4509
20808
17159
17145
5908
5470
632
9391
2680
9685
11487
14077
14796
18826
6102
7106
14752
13221
16512
9254
12469
13514
14481
12851
14803
8141
6478
2135
17456
10379
23
17337
11310
8064
13519
6000
20027
6594
7069
7420
17629
13046
14912
14673
16718
10072
13614
15294
17427
19638
6625
10037
16419
18571
13529
1749
7251
2658
709
8077
685
12766
20859
13426
14499
9221
12617
1027
3538
3323
12062
6772
15822
16113
19936
6601
19429
11196
1250
14530
635
14790
9007
3786
8885
10803
8746
132
4223
15596
15994
3007
16979
18799
807
4859
5557
11553
17559
15878
14731
4598
4273
954
3676
16374
11221
9267
17939
17325
19285
5025
13751
20600
16046
6682
19315
15788
2819
14199
8387
14589
5440
9269
3267
20583
9405
9876
7236
18736
13170
15034
9679
20972
2849
3182
17057
17363
6286
6384
5543
4106
2996
5626
19061
10536
2438
16745
18098
13487
5323
8926
17225
20224
10800
1819
16873
8370
10247
6623
11842
968
19215
8344
6756
15362
6299
3486
16015
9499
6930
19204
16195
1784
13550
16980
19465
2649
6254
4487
4616
17691
9732
9460
15582
20688
14236
7139
497
3310
14564
15574
3682
336
6642
16496
4243
12172
8217
13664
2492
17597
3545
6967
4229
14477
4088
2483
15287
1223
10083
19616
3346
20725
6839
7020
15838
5885
944
19311
9433
9178
5687
20790
15428
19174
8572
8373
13266
7411
14360
11309
18705
8617
11656
20620
2041
21120
826
2640
8961
18541
7307
46
18958
20359
897
12193
5930
12610
18057
7700
20813
4183
21023
15492
9954
3445
4750
17514
6258
286
8883
13262
18971
9933
7995
13994
18097
123
9444
15583
15312
18802
3024
6164
18262
3976
6312
16993
17130
16367
9661
13449
16948
2729
8014
11984
7640
18527
11996
6540
2641
19529
19006
162
17409
5966
1911
5863
1519
2896
7035
16138
15567
3157
9498
12844
659
6891
5368
13670
3374
1884
17735
18540
14313
567
4720
13124
15913
16712
17765
9199
17064
14478
971
20815
9409
5672
2369
13280
3208
1639
17010
10866
19013
16284
20354
18250
9312
4819
378
2273
17215
6069
15100
10627
21083
9741
14632
3768
6018
13159
17136
13696
7563
17126
6013
6754
1530
4387
17600
6006
10985
13014
17405
17956
11806
6443
17831
297
1961
3940
11122
11276
17773
19425
400
8397
18973
689
1146
3647
13092
2289
6600
10092
20470
12082
17565
6991
16201
7199
16270
6455
1460
12257
7747
15372
14461
1033
13906
2568
12850
9279
19370
21195
14253
15712
2764
1966
4528
20138
9779
11415
2250
7660
7427
3191
11743
10940
17348
5852
11505
7518
14039
10763
9070
18227
8575
11103
3576
16879
2034
15293
21122
16546
19433
4935
4767
20201
4879
11431
5797
19134
1432
12643
7529
15612
6181
14523
18535
9730
15020
17281
3988
19643
10869
20426
11367
4864
10399
3981
15595
10012
7938
13248
12607
16816
4921
4218
5156
18094
19759
1488
5067
13817
7105
2240
18059
14937
8551
5616
5861
15655
19864
20035
14784
11770
8487
3343
6135
17532
533
13129
14059
17622
9220
5711
9442
2008
8900
20200
8703
10461
20441
15692
3248
10341
9865
5379
11133
17667
1581
8799
7047
3122
10158
9089
11167
21141
15193
14286
7649
17304
6858
6196
12470
12324
16929
12020
11385
16073
19356
10240
13968
8884
20992
12502
6710
8354
12664
4688
19258
21145
3970
11530
6666
19832
15762
8358
10920
6051
18928
18053
8808
1215
19234
5810
5390
12299
8489
15673
20563
19074
16435
13040
20111
5391
2643
19184
13146
4967
19479
6225
9422
14277
3888
20588
20312
13862
19877
19534
16906
19853
13317
10516
5724
2557
504
19090
16805
11727
11735
4948
13907
8110
10962
4166
20365
3620
7786
20393
4513
7379
11927
7802
160
18699
14582
12080
6174
19776
10524
6471
20129
16217
6523
18102
586
19354
16806
8533
7629
4163
18620
10432
7040
10850
18333
19536
9590
18562
18403
7647
12093
18924
11581
14358
21035
19851
10393
14840
6306
10000
974
5870
21115
8523
2012
17220
9901
12252
12228
14350
691
14684
5717
20168
20353
4275
17759
9860
14642
3642
16553
18941
9233
16105
13552
3302
16407
2525
4530
10075
10841
17516
13309
3047
15718
12666
10141
9350
19752
19291
6042
11384
9452
5736
18230
5006
20827
4091
10355
890
695
5848
8317
15758
10575
5592
11685
18016
18521
12333
14640
17475
8772
13116
20449
12394
15105
9576
6733
5008
13821
8893
2702
10965
4060
3809
5537
18781
13573
2984
875
12256
13701
7232
13324
18487
9187
18282
3625
7230
4350
7096
6484
5026
3380
9481
9005
14658
4244
14033
16957
3967
9079
2801
19120
708
12083
11137
21046
9683
19214
7605
7438
10270
18199
10868
3441
2709
20573
9675
8505
11746
16
20901
13711
204
12026
15111
18496
11043
18474
10903
964
3872
15140
11622
14383
5477
14867
11198
3652
6752
4886
7820
2161
4954
10951
10706
6068
14930
16789
14815
2869
15950
11249
18100
20495
3421
7344
18764
4752
9643
8624
14675
17964
4758
17808
9401
8814
17591
18372
18732
2104
4250
10013
18850
15836
18660
5092
18288
58
1761
5718
3028
10690
6463
2361
11924
20691
6765
11499
20158
4022
9479
10259
18949
364
19632
19092
8806
3748
16010
700
7212
11864
2051
13918
10427
984
8584
10437
10222
7917
10765
6760
8993
18259
17400
8467
20884
19707
1702
7080
6635
17820
5348
12924
17884
3468
16550
810
20247
772
12253
12592
19570
8428
12911
10571
19556
10455
12518
13034
15594
5510
8794
20684
15920
9600
15893
14978
15964
5457
17359
14848
8033
10699
7665
14488
19716
14119
16763
7133
1054
15259
20707
21086
17682
1939
18677
6040
14738
7659
10619
18641
19735
20048
16327
16288
19934
4077
3083
1173
12587
17851
422
19665
10870
6329
2457
18071
7769
7593
15828
20022
17789
14459
14971
4191
9361
4682
2203
9770
7380
18341
3999
10332
16679
768
12992
12734
12788
17434
4032
13395
17430
9688
16908
2153
19415
17705
20148
2052
19220
4988
9921
10512
717
2297
10126
14714
3119
14903
10520
3935
14309
2974
18659
1769
20627
11543
5857
15041
2771
20279
14722
2402
16866
19127
10352
5201
21209
4114
1595
18952
19200
19172
6036
20667
2242
10729
17228
581
2830
2276
927
21052
11902
5157
19896
3431
12302
16328
3868
11378
304
10063
4526
15210
4939
16074
17767
8179
8732
15669
11773
11784
11352
14839
16534
8792
11882
12164
585
19828
75
3591
4140
3722
1202
1801
6850
537
12596
1043
18212
19520
16730
8637
15699
17200
12141
18113
20821
6422
16568
19961
10720
8041
14002
11061
19987
19852
16643
17506
20226
12369
16341
19543
10707
2997
6023
4089
20717
10339
15074
18389
14862
16086
19952
17606
15324
21182
17813
15899
7941
14422
21131
18318
13010
1866
17198
14765
10272
7111
416
13957
20372
4034
20284
10635
9428
4204
10134
4288
16331
18976
4200
2422
6201
21125
17712
15966
20051
11334
21085
16068
11489
4615
10886
12563
19224
6086
1520
6088
4015
16722
10545
12983
7272
18962
17594
7
942
11476
9717
18695
19503
20570
4653
20694
2286
12652
15541
16378
12294
18693
2295
8907
17809
11860
17885
10121
9463
18818
4703
5194
2396
19890
5076
11421
18782
13386
19863
13194
12057
19972
15182
17556
311
16773
8415
19181
2863
2822
1827
440
12175
1898
14250
12184
11652
4119
5844
15833
18996
13396
14285
15757
14745
5599
16108
9629
15874
18103
12488
6849
17834
5985
16110
7391
20982
4112
11230
17909
5635
3134
16694
14908
18173
15580
9298
7994
20293
19629
1969
16254
957
980
6255
152
11068
18570
10756
7666
5365
16585
2664
7859
755
16369
11250
3893
20522
3454
19113
1514
18038
5745
3669
5227
7012
12505
20350
9215
17305
715
10671
17000
10229
7007
13004
20440
16820
7432
6997
19916
6574
9327
6931
1625
11934
13924
9763
15092
13173
18771
12052
7731
2154
8743
7689
2045
4211
6927
3862
16150
3615
6093
17602
11689
9760
4815
2409
7377
5859
21178
14094
18772
4797
1815
13544
12659
1947
9068
17104
18128
12884
6522
2696
16623
6816
1571
15212
17444
16853
8789
5424
9001
17863
8081
18347
11292
9427
8608
15005
4167
21082
2697
7318
13789
19523
1708
8691
9655
5540
9286
10204
11774
16404
20206
19337
1368
1598
19517
12305
2238
11659
10337
16117
20735
19696
13767
9998
10957
20608
17955
8707
18361
5330
8289
13964
18597
10839
3213
13135
9249
7774
7652
10249
19222
20519
1274
11944
19592
11531
21168
13843
13680
18658
21163
12036
13458
9056
3069
1660
2508
1308
10387
13425
15716
20970
16308
2108
17756
3316
14149
4308
16261
18319
2219
1114
327
5476
6855
15174
4545
17524
9689
13294
2415
7270
6811
6835
6736
8038
19455
21042
18593
18425
13218
18330
7805
18241
7190
6156
18572
3875
7487
5345
13503
12430
19618
2083
15163
9577
19133
12307
11099
16574
5475
6610
13358
11865
9810
16710
12358
16222
20507
16149
3533
15682
7942
16199
21215
20955
21025
3568
20931
15352
16294
13667
3871
16127
14854
13406
4493
10589
19786
3268
13580
19316
11998
7081
18126
18448
13008
11634
10149
9968
3683
10933
3937
4925
7677
1186
5918
12111
3770
8456
6469
1551
16622
19448
19604
7979
15875
4938
15227
5688
3991
4931
10467
2195
8345
4685
8083
3510
2089
5884
10226
4932
18882
13300
10865
11702
11755
16166
4264
5188
6960
17577
18861
14770
16262
13352
17271
542
20182
6033
5359
15283
2715
18811
19813
17296
13085
257
10051
17685
6943
2308
11679
9443
8881
9690
1727
2473
20400
20310
13546
7255
20692
19794
3199
9343
8980
14949
19206
15004
1059
7248
13480
11605
14198
11331
17783
1811
18430
10142
18780
8933
2604
3621
13333
13851
14464
13582
12055
20067
3335
2924
812
16061
9540
8114
17019
13758
20849
6109
18506
8337
12474
18723
4725
17998
9697
15491
2543
12454
16243
1567
1424
9186
5342
1705
6142
16077
16995
11945
14063
2171
1166
9657
17510
10163
8554
19229
234
11348
52
16509
18101
5850
12049
14723
19808
13549
814
12312
5135
10899
5779
20732
5185
7684
8194
1278
6608
10537
10715
16614
19695
1046
7466
356
2213
839
15465
16225
2306
19026
15944
11298
270
17453
4873
1183
1635
19041
13728
5112
7142
11277
5917
19809
16541
10107
2503
20351
15978
9006
15217
1260
20759
13534
7679
14205
3456
13002
6741
2535
19993
20513
1366
21155
10504
9910
3137
6212
2569
149
19024
2687
9772
16307
20733
2607
9596
17473
10293
9418
20194
7104
404
8952
19977
18194
18202
16876
16449
9027
1611
12108
1115
15851
15744
9275
18800
14084
13416
17389
16839
19766
15449
14913
20068
4923
10922
11910
19265
7712
16377
4559
629
10982
13947
4735
21143
6662
2485
16687
3662
8671
15025
938
19560
14834
3752
9435
2824
12757
13623
16151
18904
3500
7268
6003
10975
12944
1564
13175
6365
6005
4149
19976
10557
13289
16468
10936
10689
604
19149
16069
19242
8853
289
20478
12076
454
6057
19375
10938
11329
6677
2513
4757
6130
15671
15681
14270
17949
18740
11645
13669
8734
19758
18391
8231
3295
6202
1354
18968
18004
1942
7672
15349
17149
8333
6021
12214
3167
7846
3596
787
19607
14428
12455
11646
6724
9799
13152
10532
6386
14085
10492
12449
16285
14545
18415
6315
14744
13597
10696
10531
13682
13966
1984
20192
10410
3251
16305
2578
7579
16470
18498
4427
10874
18551
8316
31
6803
10053
8771
10686
18988
241
16692
10511
9835
8374
19286
14271
6092
1910
1309
15629
16872
2320
5564
16653
11300
16032
18898
8301
8738
2524
6229
7353
18577
15139
4875
18222
19626
10815
13753
16228
2625
15468
11787
13460
19741
20347
16849
10064
11470
5636
12644
19233
6829
1097
2450
14977
15701
12622
3341
10847
20238
5175
14501
20923
11498
14146
3918
13979
19245
10807
12425
8683
17719
4278
7982
15896
4893
11891
11185
20614
5013
5949
3726
1716
19167
6354
16231
20518
8107
17139
1479
19023
8640
17204
4271
8601
959
19443
16709
11555
11000
6507
11541
9525
9084
9071
21152
15956
670
2803
477
15862
19755
13706
54
6638
12682
18574
781
10872
2095
14621
21106
2812
12508
9234
4830
417
7571
6706
2411
18837
206
607
14864
19019
6695
6919
13717
17850
4903
1016
12520
11332
12157
7585
17776
2632
16211
10105
346
595
9202
12503
8495
20136
5517
746
21009
3906
4258
14278
13125
19474
3426
11263
4150
1840
19732
19457
12936
4613
18954
6148
2573
19729
7735
838
8154
8949
8618
20730
19484
4563
16664
7388
10655
16784
5647
15493
3105
10325
7755
9825
5665
5269
1893
1426
15997
11
13565
20503
13087
18475
5312
16075
16720
3296
5860
7821
6235
11253
6376
15664
7886
15557
7678
15198
19178
7673
5818
7948
19209
14246
4481
7053
3281
1751
18932
9253
19841
7250
3963
17090
9548
1531
7244
6519
14985
7726
18082
1389
13634
20533
19742
12550
8208
6649
2413
20380
9890
6393
10374
7222
1096
15097
11350
4517
5003
20272
10997
17237
8363
13202
17512
10673
4103
7009
7549
13260
11824
16196
10447
20137
1330
5782
2881
14537
7912
17154
393
453
20549
18437
11715
13420
19654
2742
4659
10943
769
933
4772
3994
10966
19552
20869
15172
19
17253
17005
4806
18137
277
8965
9196
4352
15511
19734
5232
18894
11629
20411
18652
68
4309
3219
2762
10459
10100
16535
12541
10443
9055
13278
16951
10394
11615
2066
18083
11962
2772
130
6712
11516
2554
1587
12241
213
13193
7707
20695
11647
12448
14644
18805
1154
16961
2253
16655
13890
20601
18054
20097
5767
17899
20401
12311
3873
6766
13593
16033
10754
1636
11776
11162
7116
462
12048
8328
10450
11183
8347
13298
1133
2663
1475
17392
8389
21117
15495
20709
8498
20645
19410
5940
10894
1511
11825
17775
20172
4531
17070
17702
9987
14075
10667
20537
19624
7118
1209
15257
4881
5155
7929
20795
10463
4303
10890
3043
16508
18005
19189
1841
13139
16682
12063
8696
19803
18530
20909
4415
15340
17744
5444
9067
11339
3660
538
9167
12431
17252
5276
6072
15022
3641
14561
7573
17572
19423
18486
4121
13972
7314
2740
16109
2087
3889
1885
4376
15042
16800
7897
4978
14958
2086
7830
2677
17798
20333
4800
12378
4555
21213
17807
14727
20580
16163
18703
18080
18131
19749
18012
7757
13742
14303
13316
19283
10562
19025
19810
14778
9538
2836
16160
9882
9457
20235
3298
14576
5317
19203
11410
9354
10179
19955
19554
19282
2705
16864
11895
11465
6916
12087
12727
19882
19527
17168
11595
1852
11314
1517
8720
2693
7253
3759
2668
18301
9065
7219
6060
5172
1665
4804
1719
11919
5187
5639
12156
11899
16695
7366
3740
16177
20786
200
4432
17023
12755
3027
13780
20935
1083
13615
15153
608
11922
19593
2948
17068
10435
20630
9080
12453
18396
15218
13531
10312
4260
8147
5523
16769
2850
14397
1521
922
7495
9488
9170
20755
1188
17114
13659
13798
10318
16312
19964
14438
2076
990
9674
4294
16481
3152
19232
19059
1569
14089
4095
6905
7355
3789
5960
4122
11556
1038
9344
15951
18872
15002
10820
13610
11101
15900
14079
1169
16323
17632
17274
16592
13498
2198
20772
18147
1832
20464
7024
1746
8490
10514
9059
7545
9169
7680
9920
880
20298
21208
8529
8856
467
12317
1869
16702
8148
3146
19994
6945
11557
20024
10521
9022
20124
14001
17933
8116
9927
19321
19431
1837
4973
7748
3094
17634
19481
18419
2686
19655
8936
9780
3330
7988
9619
449
12543
1589
20240
4664
14843
17770
8756
14036
18375
1050
9119
5953
14121
20801
9308
13931
20268
2893
11802
9307
10078
5047
20038
16889
9992
3034
19444
14981
6456
10600
13231
734
19962
13321
9093
2977
7811
18986
1539
15402
19066
12154
15897
20572
20164
17900
7217
5976
12360
774
14196
18795
19288
18205
15271
7908
15269
15166
9322
17976
14592
3785
3640
10794
2817
3125
5340
16542
11001
12903
7021
16955
17447
12678
10645
4956
13560
19345
19237
12554
11258
10714
13485
13412
17088
18827
2999
4125
3725
17066
15984
9909
13016
12088
3073
1100
6307
15782
19953
15924
7356
8042
18246
18099
16317
17513
39
16281
675
15623
16421
7097
12116
11228
16795
1870
13989
4473
1372
13024
19705
17638
7070
11588
2403
8331
9581
16263
319
5028
3916
3110
9171
9448
20953
7762
1700
21070
9396
2656
16416
14357
3859
3178
12341
3863
7550
12614
17485
12562
11156
6653
5082
11062
4665
2445
10859
1086
12011
11799
19910
1642
11007
4253
3006
11814
19540
10636
14411
13539
3051
6417
13451
4557
16750
8053
20863
9698
16632
14072
4354
20256
5264
19072
557
12839
11336
6595
4081
8943
3861
18332
19792
15228
20625
1944
19057
15266
17124
4169
9948
6119
5758
344
18747
5507
12162
13662
18136
21188
20000
18229
18140
3776
3358
18231
6076
12270
4178
18833
5116
13033
15282
18114
14583
20831
15666
21072
2212
9385
8269
16469
8903
16875
7555
16096
3390
19112
5296
8228
832
4519
12765
5565
11092
8760
3658
7214
11940
111
6886
19599
5374
6911
56
1730
8891
15116
16349
6824
12629
17790
6186
14651
10856
13470
17194
19773
16214
1584
17684
3325
13055
7637
263
7480
21032
14739
13307
15934
9216
8205
20910
20833
15926
15310
15455
1474
5501
8182
4027
19138
4096
9004
15739
8409
9476
14471
11670
13475
19333
13935
7855
435
21028
10745
6128
20344
18443
16456
14759
4648
16901
7461
10559
5347
11074
18877
11021
4057
19958
2156
21048
19139
14011
9718
7163
4853
12561
8950
3895
3415
15133
2844
13916
7714
8458
989
5321
4280
20777
5931
18427
8730
17190
4987
10376
17517
19449
12006
10823
16921
11791
15714
17730
8227
19521
15154
1208
9745
0
16427
2674
12421
13596
10190
13318
3778
18859
20907
2134
8267
1020
16495
12608
12521
4789
928
2978
7552
11807
6380
2356
2738
3464
6081
11340
13618
7328
3461
2488
17878
14873
14051
6603
9389
8048
14608
14516
15516
5086
20232
13429
17407
15939
19310
13370
14945
12268
20028
10759
11964
3266
6913
5766
19308
17906
19305
15903
11307
20973
19141
12301
6047
8914
11946
4619
6944
4400
5236
18261
16749
14168
1687
20381
9749
2895
1518
1950
7535
15039
9997
10185
20852
16445
6815
10197
7302
15985
5287
20063
2263
20456
2446
16589
17542
6705
12350
2545
14571
20599
6746
17127
2014
8012
10382
7508
9956
15236
4968
17870
261
19018
10831
6634
7646
7974
12053
18216
3237
4860
5957
21166
4076
11049
6779
9078
7592
8011
14993
8423
941
1244
9552
8565
17408
15801
10651
14405
11051
14615
10845
8120
17972
731
18869
20857
5490
1218
20677
14222
8988
6205
4972
9485
11439
10921
16891
9556
7448
16274
9282
17009
14579
11461
11134
6291
11211
6497
17726
5050
16123
6421
18225
12971
19180
18829
14691
3274
15305
18777
20621
13198
3910
3670
11586
19887
10613
13718
3197
5625
8390
19144
7178
12109
3286
3624
8592
15725
15806
14763
9280
1888
3869
12040
2926
3520
3150
3389
15275
15880
5597
8826
1117
8219
11692
15784
21037
12880
3434
3275
3823
7313
5801
639
19428
13803
16204
14206
18127
3757
20807
778
18816
14533
6491
15220
9635
15863
8929
4263
20964
9504
8819
9329
13754
7444
2321
4382
9970
14190
18913
17079
17134
8520
19743
12433
4811
3498
10460
20119
11303
15379
12814
5474
8908
14340
9150
13238
6483
6596
16275
7435
4992
17840
2268
20180
13410
1435
7449
7093
4175
8805
1434
53
6175
15418
236
5097
3489
11687
12778
6965
20195
11090
6162
10587
18183
189
12074
7183
19913
155
9299
12532
1508
5410
851
11457
14352
18897
5402
17743
697
10280
13118
13326
20652
5589
15713
17443
18505
7754
5743
13905
17178
2528
1637
10232
15110
7341
2821
4391
354
2469
20139
5657
6778
6872
1651
1497
15248
5750
18264
9595
15879
2251
18122
7831
10239
6974
4046
4610
8726
20650
5283
11731
7326
2200
3842
14801
99
366
13384
6570
554
14932
18088
514
14418
16783
21172
10685
8598
11655
12908
16525
13925
4866
13393
17179
3149
835
1357
4234
12750
21060
16057
15537
6571
13154
18069
16197
18880
5862
4153
7604
12516
18936
20011
13347
13265
9604
3244
4713
12646
911
7152
19690
10362
18537
20016
4349
20721
20327
14213
195
9739
8245
17824
10611
7951
12602
2556
1747
16545
1127
20490
14865
18845
9316
16411
8515
19862
10565
19796
20317
6676
9624
16748
864
228
11220
2229
19060
2875
9914
1877
16128
11080
17665
3353
20096
13151
20171
5208
5314
16818
5480
11836
3521
19244
10289
18135
16394
17708
11266
3546
5573
70
9649
9861
11453
6228
18254
3301
14344
8708
12501
20075
3836
4880
18378
8473
12775
13881
8596
5536
12110
11058
8324
9980
7527
3938
19859
1174
5304
13762
19706
5843
2654
4173
14403
15837
19771
7808
10981
11391
14990
4764
17181
20143
9953
6435
2036
9319
17056
14817
7387
13247
17731
16949
12767
9569
6395
5254
4916
6532
10960
4329
17167
6924
1881
19182
7972
3140
89
7304
10243
7894
19922
14080
18167
6541
12363
19998
11603
10071
8644
10908
11978
14886
20830
18580
14773
13028
8361
5010
19692
14931
2293
17593
1277
12393
13029
6406
12792
16581
6362
4070
8085
11341
7522
598
17992
12701
736
2912
2196
5230
20394
8005
8494
4113
10299
13884
16612
576
641
1786
11867
20946
17234
20578
8627
11970
12672
7516
19001
3840
205
8665
13103
4551
2960
10668
7417
14528
17018
18215
20167
9936
4041
18754
2078
932
4512
10307
3968
3801
17892
452
4177
16335
13264
11801
18079
18752
19548
7107
104
9672
4290
13956
14577
19475
10345
15016
5243
19835
13772
6400
4479
8969
1711
7014
9891
4085
20788
2724
19467
13062
2741
1607
763
8687
15663
15120
1471
17614
143
17414
1148
19817
10978
16146
8791
13709
18583
20729
17053
7082
18616
713
11874
14327
9783
2979
4577
9622
12641
3828
1580
11164
259
21222
9182
16758
6784
9791
17898
1026
16896
10451
1126
6053
1477
5532
12690
13122
9863
13778
13704
846
20425
6134
1241
18346
8676
19532
10495
5608
6441
20431
4518
14221
2998
642
13695
9790
2458
5495
10630
1234
2865
2204
16703
18431
2173
10862
7373
7025
13107
10883
13080
1887
3604
8069
12287
7970
11651
18388
3949
2673
15703
10169
13545
5922
2035
5165
6802
742
11640
14490
18643
11020
20646
14698
11684
20892
5356
1259
9870
12507
13813
8073
1211
19943
12860
20932
19440
1009
6578
9423
8869
4048
3196
6173
1164
13645
12514
11414
9613
8497
725
17174
2115
15192
9333
19246
12791
13134
6009
17566
14274
1413
14426
3551
10818
18675
15469
6904
3349
16576
7110
7918
9897
9477
21105
2272
9796
9509
14139
14699
6599
14967
16762
19764
15055
12271
6580
9379
18045
14519
10558
16698
6246
15036
16629
8697
17701
8643
2331
2505
11402
7134
18440
15364
11147
20149
2475
15654
2178
8898
1825
8367
6116
3162
18922
16337
11584
7827
1661
16578
10911
9833
17613
5422
19329
14390
15199
16757
18696
14899
10196
20207
1227
10004
17902
11102
12365
5147
6823
11604
6432
6865
6324
12937
20128
17147
8977
16216
18647
1809
1733
17676
14220
14547
7045
9681
11720
12934
10007
20144
3685
17214
16648
15214
19438
9232
3151
13761
6847
2634
7986
18961
142
15835
19010
19186
17780
9838
8066
9325
7037
3059
20802
17391
9472
4373
12566
10110
1736
13922
8527
11563
10907
3797
11905
14634
20517
4680
21006
486
17855
11830
4946
15635
9155
16491
7041
17668
13864
1846
20152
10590
15752
14711
2938
127
4536
17523
12355
16236
16734
4996
2723
2218
3297
4443
12812
19799
4080
5631
4762
694
17212
17895
16114
6464
4110
14116
17315
4934
952
8237
8536
3070
8298
19238
14387
15388
386
9297
20919
17604
2648
15789
11469
14900
8786
20632
6771
20988
13559
4033
19404
17695
17071
18550
17837
157
13423
8784
5788
2018
15476
5159
2616
14588
6108
12728
11950
2970
5336
11573
4274
16978
3433
4460
10375
1172
14135
17445
3715
2005
17165
20682
6742
15313
12284
17618
16014
14825
9894
18794
1879
19255
17180
13315
16373
20708
16700
5064
20811
10568
2130
747
20659
13306
18442
13522
8106
14057
18907
11296
6837
19601

16619
3383
1006
1501
11145
5288
8978
4849
381
789
3795
4010
17896
12957
7826
191
1240
9135
14389
5518
18479
10702
4899
2669
7674
5727
16478
10998
1486
15982
2676
4451
6374
8138
11202
9033
2109
1922
12818
8947
3170
19559
11359
1280
15564
12203
1199
1326
7266
19717
11229
12988
1205
3496
15895
5748
12348
6220
11838
14877
15129
16770
5552
10157
8192
9332
17282
614
19361
17352
722
15343
10019
3400
21171
3488
3095
5699
19221
8504
4552
13106
1725
16340
4841
18930
11269
17424
4549
13616
10129
172
16910
19720
12589
15972
244
4115
7958
19925
9387
7297
3644
5730
3443
387
13250
7853
16013
4701
9274
3746
10278
13336
14950
12568
6572
10104
19648
7849
16420
16650
179
16583
7210
9592
5202
9149
3211
217
11462
9390
11607
399
6567
10150
7543
15311
12388
19420
6025
14678
17857
12126
3645
19568
14099
3883
20769
2221
13630
8381
1421
1302
14641
16790
12510
5693
5204
18702
2536
1588
9212
8322
17864
11016
19486
13784
17877
16460
4587
7655
9820
8850
10991
9277
18500
7071
19516
4805
13967
13927
17098
15921
4670
14128
12171
2906
9853
16823
13241
9495
14986
17999
9191
883
2496
6955
13227
7874
19411
15539
16582
20023
15464
20328
1499
11861
18464
8022
6145
16266
7367
4117
16704
7323
9189
3718
16143
11790
10342
5324
20913
15360
20434
15009
860
19659
8695
6555
18118
340
20160
17410
5706
16162
3391
7179
14041
10543
4527
6095
5313
905
4093
19920
1620
7286
15144
9758
15590
1151
5341
5141
8796
4355
1325
13987
11636
10640
2006
8024
3631
601
19721
12286
7336
3255
13633
16250
20212
12670
9368
18844
1722
3680
11758
16189
5375
20357
11214
7237
14685
5578
18979
94
3573
1350
20177
13850
2452
7114
17191
13846
15499
15586
745
15647
10253
5178
2653
1087
6401
6652
14086
19558
18854
7559
8667
11995
7315
3153
1507
4375
9788
14988
3554
11119
11528
2133
2627
5534
11120
5350
2470
6382
3837
1082
7264
5399
14365
15496
2787
8457
4014
1122
12495
14737
7890
19191
13489
9549
114
5123
15407
17277
2733
18247
2474
966
6158
12390
9768
7463
568
8051
6346
11398
3008
4736
836
16208
6431
8087
1498
1025
1074
18040
10206
11449
1664
12371
3634
5125
2867
13331
17581
12321
18207
6707
1504
17822
10852
20385
13509
1540
11520
14294
18655
14980
5417
9294
13946
5117
4357
8119
15741
20990
3990
8940
9338
19693
12875
5559
20013
13401
13497
16193
1387
13748
8728
17336
1875
8735
6027
19460
8332
16735
15811
12809
17603
12663
19268
9193
131
4058
15721
14497
13637
12965
9973
7445
9100
4538
17374
8599
2127
11843
15938
10287
7046
2194
15659
19317
9550
1476
15441
6932
20489
1344
16690
9977
14308
8193
13613
11111
11676
6593
11463
11319
3261
1273
6935
16038
5632
20911
4637
5115
12793
14275
14733
8564
16139
15505
10106
5881
14552
1441
10151
21126
15928
14663
14174
19469
14457
6194
11002
6547
16457
5364
6726
4105
8535
12491
8931
17321
16333
1848
13392
14155
14291
4917
7537
20835
9710
1872
19267
5716
18888
12405
12529
19341
12675
2302
631
4310
7408
9633
13276
3556
3124
16835
6188
17839
9837
407
7782
16766
20934
10638
18483
2022
6832
16590
13624
14609
8657
1015
16185
17862
19159
6678
21094
17979
14436
9666
15143
11529
17742
10238
14482
20070
19492
10510
17222
20297
10231
16437
16759
14550
10887
12816
17819
15536
8886
2423
19143
16567
6448
15044
13407
8134
18299
7011
324
6233
21000
20965
14354
11423
14335
18963
19787
12216
4181
4625
17829
17342
20983
4955
15035
9470
2080
3331
11044
2809
4930
16409
20825
5199
12891
7688
6689
17476
12790
20738
8704
19153
4116
7407
145
11884
2373
797
1774
8831
5109
1958
9241
13681
18839
8699
9962
13562
13578
6392
11283
15572
11399
8962
14927
9946
9207
8666
13563
1615
19822
7721
3806
4235
11920
12054
12212
10448
4501
18081
14666
13848
7234
14439
8972
6413
20253
3099
14660
11362
10634
8650
4024
7572
8635
19205
175
7006
18788
11141
8597
16733
17908
5151
7946
17507
3106
11349
12665
20084
4521
2670
14299
1892
3467
9868
11587
955
4870
15605
6946
9502
950
13035
478
2174
9691
1876
21091
5944
457
9925
19579
10505
5875
3055
5685
11575
6517
8670
11313
3091
17480
12069
3207
11316
541
9484
15327
16287
4638
19990
12878
11760
18956
4130
7425
19152
20532
17339
14819
13646
9347
10932
12402
20528
4064
107
17318
9776
3089
17835
11473
1669
20914
18018
14473
2864
18927
11959
5873
1144
9147
20117
8741
8834
11130
3477
12273
2595
15112
14184
14076
2270
19945
17157
10726
16930
4068
19645
3664
16516
7218
10434
11195
3972
18209
4945
9934
15772
4994
2707
17396
6813
12424
4409
1315
6716
2708
14071
8909
8481
4687
10074
18168
9445
15064
11322
19801
4345
10796
15802
3694
7709
37
16963
14372
7261
2205
1917
11259
5472
16488
12777
13594
11374
7410
18662
15142
16747
15958
18220
21148
16831
7177
10324
602
8610
852
2287
12553
7765
4981
16618
18217
121
6454
8781
8308
18214
7491
4884
13210
8712
4904
13183
12694
13256
3407
16430
10880
18163
9035
587
6503
146
8525
9192
5964
4002
728
821
8906
2937
7084
19344
13820
15247
307
7558
9030
19231
18546
5297
13901
18770
14616
8692
17706
4276
5525
11144
20720
12205
765
4671
11521
17794
11870
7698
17539
428
9130
12490
6890
17369
1190
17944
10087
20996
6527
10340
8065
15285
8623
11561
18336
14883
16315
18504
9237
9040
16178
13320
1423
17244
18564
11151
2511
14458
16792
20576
10757
13376
4828
12391
16462
6176
5831
13001
11441
2137
19047
1472
77
13973
17367
19634
3509
13071
21018
7725
5846
10727
11342
15250
10912
5712
10780
17426
2491
8901
15678
4882
5030
19698
15995
19789
20903
21075
36
9304
6364
10164
16055
15367
4620
16602
17454
6461
5709
18497
1777
8611
5307
12066
6106
11330
16941
18993
1638
12015
17663
10534
3931
18462
3326
3168
13367
775
18460
3665
12446
6654
9489
4990
14276
17540
19848
5906
20321
3934
764
2190
3537
11078
12845
12630
14315
2055
9049
16556
9984
20663
11999
8930
4170
3743
8823
6170
2562
18120
1041
1634
11745
21061
15640
19325
180
11669
8210
14897
17656
14106
4038
3710
1667
16616
15276
6579
9586
15381
7485
11601
865
20157
13567
1924
16295
15149
17035
14572
14450
13178
14968
1663
20775
1724
3225
5170
9480
3818
15106
5722
10735
21033
14713
9880
17402
248
20109
18008
19507
5210
10316
16886
9326
15104
6845
6216
5629
1179
8764
6302
13192
7883
7939
19580
12685
6531
3696
13526
13235
820
8512
20548
9359
5904
15006
14857
6423
7817
19840
6696
2825
71
9197
15905
10711
1381
4516
9468
275
7618
5033
21175
1383
27
10540
7843
16156
13794
4857
16657
17554
1779
4341
9019
11742
371
2681
5322
4226
12885
20719
2142
16095
14073
11901
11841
5221
14661
14832
16006
7975
4635
6679
13508
15049
6553
8207
18062
16726
16031
2226
5196
4017
19207
19870
12929
2387
6064
8315
7548
6525
8187
14776
10953
12269
908
8753
6139
2310
8749
18364
2783
12803
4286
16925
4158
20165
1690
5768
20407
3405
19501
10333
9847
3233
227
5246
15253
6936
4911
1437
12118
9097
3764
4554
18730
19058
18322
10801
12206
20702
12478
11923
20383
15545
12240
13525
13805
11732
14407
17724
1932
8748
15631
7208
17639
20641
9016
18025
21186
21100
20875
655
9867
4986
10084
801
19642
3224
16135
4136
8522
3039
9528
6661
2925
2390
20443
4951
18668
6275
1883
18959
15453
1324
5358
19666
2271
19880
7089
359
18377
6238
15069
10876
19054
17355
794
17766
15224
18560
21177
18065
5697
2467
21111
20243
15307
14920
19147
4896
15779
11943
18713
3246
589
14911
9904
19885
8871
1814
18656
16528
7783
16359
11427
11957
6259
12224
4322
10778
4998
4165
7865
18295
12397
15073
6010
12191
6743
9641
20415
18451
15288
17968
8606
33
17012
18169
18745
4478
3529
16352
618
20460
13490
7184
9753
8793
1080
4003
3941
5284
11618
3160
10245
20399
3512
8641
7443
120
18524
18557
3364
266
16998
16388
11201
20657
6133
3984
3956
7126
5174
6888
11219
17943
20320
3393
10821
20218
10094
6178
11913
20642
15962
5078
8091
18601
12915
9558
11871
11065
18317
2967
8812
17232
4539
4049
4729
15189
1138
9877
4135
11976
5079
2581
16439
21109
12539
987
12718
20116
7352
18296
20438
3590
11547
3156
2870
9996
17954
17658
1940
19891
10260
18021
8013
3727
7284
5325
2560
2124
19997
16636
8562
5070
2815
12658
6750
13970
9413
19396
795
1618
5934
2216
7213
8215
1337
17261
18933
18123
18185
19526
3072
20785
13628
18115
7203
9813
2596
7777
10964
1871
17946
8714
18814
1824
17171
370
6264
13581
19684
10202
18627
7864
12090
2879
2254
251
20260
20748
2994
17568
2420
4111
21039
17379
4947
3688
19367
20153
3378
3240
17469
18291
18841
9593
12708
17394
10488
7594
1744
10728
1439
9566
6529
13435
18219
7227
1296
3113
7564
9138
3603
18256
8263
3215
14549
20891
19949
6755
15265
1833
19511
6407
7298
2521
9821
3882
14876
20001
9424
1925
1267
9235
6251
12194
10809
11929
12848
8235
12735
5431
7386
2983
6725
3315
2500
17254
18522
15990
12009
10561
13609
3964
1524
16842
10353
1197
14863
4647
14415
10676
3891
19812
4553
9077
12291
2453
5389
3704
8737
3531
9762
5303
12542
15145
8992
18678
17420
9412
17107
8827
11708
17203
7882
16272
17016
12038
17846
17969
1882
16685
11526
14772
13201
7608
625
15382
15954
13952
14543
5152
40
8271
12033
3188
20322
20766
19031
3107
14729
13715
14885
892
2376
20981
19986
6787
8096
4227
15743
9714
21116
18311
13233
14964
19009
20210
7957
11535
11550
9573
19555
11632
7598
7729
18671
19546
16787
8851
203
5535
5898
12377
1783
14324
21174
2719
2435
15773
5289
665
405
5807
7091
13197
11035
1645
7238
21076
7945
13527
3161
6722
6472
9687
11767
530
20942
6118
9388
6926
15857
6066
1299
2193
3112
14248
2854
18697
3847
10682
5073
14186
2401
7723
9589
9129
4675
8724
8824
20592
6211
13980
19804
15329
12235
563
17042
3542
15998
2722
12621
6045
19299
4039
20147
10502
8159
630
12016
17073
10096
20437
8376
1338
6900
8983
1641
1150
13877
6309
7128
19424
17917
11590
9323
5587
18076
11610
14159
16080
2810
6793
2843
14603
19236
10221
704
5212
4207
1575
10906
13793
284
10956
10731
4431
16280
1919
19901
7992
15079
2907
16502
471
14317
11429
17573
2471
18366
13047
1458
9021
10209
19263
9313
10684
17082
20838
18162
4611
19434
1210
10366
19342
3599
17795
5504
9516
20135
14301
14281
799
1184
15948
475
7200
2544
13215
4821
18503
14306
8719
11364
13827
10391
20334
18531
3066
2744
12132
1301
14852
10423
6861
7029
383
12285
6993
8226
7985
7732
16994
13127
5671
9365
10542
5681
18491
20526
15115
6082
13849
19701
6368
16011
17442
8121
4366
9494
20774
4231
9449
528
18141
1351
11559
135
15425
375
15376
14029
20295
9455
16954
12047
15607
9185
4242
18889
11087
11241
11722
3618
1099
1019
7059
3632
20956
703
372
8911
13643
19854
2062
2468
2278
7796
8882
21147
20287
10101
5054
8335
1040
12368
10026
18769
158
4775
18368
20817
7566
566
13222
21134
18673
5756
11037
21043
5449
7833
4852
10273
10888
19254
12732
13766
16989
10050
859
18892
12857
8300
16265
4283
12432
12456
8550
6270
18792
10519
11570
1867
8566
13868
10328
2806
13934
5209
5764
17026
16863
6257
11189
13153
14489
1704
9986
5607
11956
20251
17436
20082
20043
8677
13404
10331
14402
19989
5845
13612
21197
13408
17989
11446
13083
18534
15957
15346
14511
2231
577
6544
18164
13319
8894
15436
9899
18188
18245
1226
16666
16124
13111
2317
4426
1419
9096
7816
4398
7424
11523
7807
12149
5983
5414
1487
5621
11245
11540
1734
889
13836
17378
2794
7078
17398
18602
1062
5106
20845
8243
8436
13900
8296
3741
13622
20041
4515
7357
14814
3601
3074
19724
6146
20662
5392
15768
19044
10515
11064
483
4446
2290
11525
17172
17299
5228
12831
2583
10549
20089
13011
8136
2790
15808
9073
9044
153
2103
1377
18420
14314
18735
14406
14364
20974
4715
17329
20196
443
1118
12726
5570
4397
19219
855
13683
20506
14791
9766
10889
6292
10067
4898
17021
798
12987
19390
4979
8863
3819
11915
9896
7337
16986
18400
16477
5781
18938
21014
4787
12061
8589
4497
888
16397
9801
11706
20349
19723
15548
12527
8970
10737
7422
552
2339
14167
15987
11163
13824
10734
2166
770
12115
18154
1750
8070
1775
4371
6591
15767
18321
3361
15800
14048
9400
10020
8594
5231
2073
15017
10251
13953
17463
7483
1091
508
7779
17236
6267
7969
8209
12200
13771
17504
11585
82
12870
13240
9493
919
2597
20968
15585
3475
3446
5825
3724
11837
9069
10980
10654
9260
2853
10139
1954
8845
10040
13486
17762
18842
7119
216
18276
5044
15531
5290
9991
13361
19273
5386
5719
12340
15693
215
17673
6427
2920
16423
2020
14108
17918
14694
19102
5659
4596
12782
15843
4964
2493
6899
6558
17133
9203
2631
11649
14097
13377
4377
10001
1844
14838
10208
16499
1807
6428
14386
16724
7457
6339
3567
3879
17903
14833
4468
15161
11031
5277
9976
3957
1265
2026
1042
727
15910
12613
10470
16517
2784
1859
4768
294
15000
856
18712
9018
561
20044
12292
4696
5886
1221
14263
5451
8380
18808
16987
6414
16598
761
14256
14491
15256
4633
7467
623
13432
2887
14066
901
5447
12024
10309
6989
5263
18967
13237
16855
18224
5925
20499
6489
17397
14496
11873
9960
15056
19660
2856
9301
10187
8280
11063
9048
12022
14026
4824
12945
14297
14082
16903
1355
19437
15442
3401
13164
17564
18242
18244
15911
14260
20638
14379
20339
15821
17716
15366
2793
6333
1167
18298
20668
13136
12799
20912
18832
12888
9250
9284
4154
9296
16779
18416
18688
9106
19318
3607
6391
11497
6446
1577
14639
19148
4576
2768
20285
10705
13409
17351
13948
6113
13747
2752
8050
6693
20018
8260
9871
7001
2405
4362
7704
13867
18459
4005
12909
18532
11238
9352
11658
7538
13911
14388
14423
17498
6198
3762
16932
11953
12820
14392
11227
20889
13012
9172
9929
11566
12925
12119
668
15472
20864
139
20455
7375
15792
15907
17761
19098
8398
3432
19115
20085
18945
5673
16660
19132
580
15869
2478
3147
2743
2456
551
16501
18414
7720
12387
1903
2897
4
15824
8528
19040
7398
16091
6150
13032
9415
2623
10471
14578
2002
6334
19355
18058
492
19462
1246
11294
19257
17914
18586
7258
16097
13044
10688
20173
9520
660
3851
9245
5777
13453
16761
18565
8700
11606
19230
501
13814
4628
13334
4344
18061
13812
224
10918
8600
881
4128
3046
17995
19126
4405
12248
481
5461
1125
3239
599
14288
8221
15480
8045
6450
5400
10421
15917
1175
7676
5689
15416
20764
20781
6151
12067
20276
9965
8963
3230
21054
11512
9578
16549
6536
13732
10172
18258
11968
464
4262
19663
981
16649
9587
5542
7932
3493
8180
2241
20523
13428
12406
12145
4066
12304
4794
20585
4612
20467
1339
5530
20262
4877
6557
17661
9542
14105
20960
17195
9803
13037
14311
8100
4514
7617
3765
5443
2517
16136
9787
5085
10426
8057
17687
3506
5921
13155
9310
8809
9648
8519
11519
15959
14241
10216
10967
17307
5876
4910
20602
2628
10646
10025
4424
12895
12913
9453
10095
10844
20370
3998
11070
8668
14997
18178
3065
9454
2138
2060
9786
4133
16240
5407
2833
2917
21196
13730
15676
15191
14369
338
12821
14070
10574
18146
2351
1196
15704
6972
13936
10319
978
20595
15846
2848
17519
1610
8062
5539
16480
751
351
15665
20837
18184
10652
13764
5103
14024
8438
2406
1081
12417
2698
9264
5497
2177
13137
4450
11097
12565
5642
1291
7639
19125
6990
20726
1256
4499
5526
10709
20500
12802
7374
9474
5450
13100
19777
9219
20409
18349
4699
11054
2972
16554
9003
662
11859
17272
6282
14916
18001
15617
3751
10954
14448
235
4820
1792
12296
10793
5637
18095
14725
20281
14816
2766
1913
14398
14813
12404
16627
3638
13731
12952
5485
10212
8236
10422
20049
9372
18192
2343
7431
2476
11175
19240
10601
21102
13295
12981
3096
15176
342
1778
7671
13883
20236
5684
15240
5456
18034
5739
6769
1826
16400
12086
7536
16668
12932
15710
15107
5999
16090
20424
12139
4739
14889
18948
11916
2167
4025
18862
2176
245
4763
16669
6875
10732
18195
4037
12290
16699
10892
15533
2559
5182
15219
17037
6218
14295
13944
10363
19331
11480
18228
20870
7347
5429
1766
19747
4761
4179
20987
12414
20371
3730
13756
20980
15771
14556
17966
19104
2739
19000
20378
18947
15679
5104
17678
2868
14849
20004
18033
1145
6647
11627
6699
21211
7961
19045
2808
20069
7204
8262
18263
3763
20042
20536
3459
16213
6323
10058
17205
17376
4337
8101
13054
627
13880
5416
20648
7247
7023
17710
8360
265
8307
9273
18408
3517
18515
13462
14443
17571
15810
12815
1484
1225
15333
20712
2530
1290
17421
19063
18651
15272
19176
3942
10700
226
17986
6982
12201
16510
917
12346
6381
12373
2585
9246
15357
7030
4186
3626
5118
8474
7274
14339
6928
8840
18903
17569
11756
16563
18820
3678
2730
1596
9013
6918
1998
12918
18060
6366
19369
1728
20791
9292
11055
19442
12626
18523
2963
11883
7914
19791
7295
3352
19676
16609
8758
1393
8508
4636
19605
2955
13466
19606
12353
21124
9369
15473
14654
8001
4053
6479
1694
16746
1789
16443
15450
8629
4710
5580
3628
7736
7233
3483
20142
161
12713
18329
15902
20683
14602
18402
17669
14424
13796
15818
20479
7872
1359
20637
9515
15719
2407
3925
20944
10805
4565
7187
15412
11907
673
17856
18237
808
18750
13974
10950
7836
2750
6037
11747
8109
7306
5544
3180
12231
13878
20009
16119
19346
10108
11146
18151
2904
10227
9002
12428
21176
16804
10439
14750
5062
8858
15960
2371
16573
19430
18472
6097
12481
11234
3163
5186
9543
8754
644
16780
15378
3406
20754
12027
2944
13251
6140
15861
15255
10183
4279
13739
7039
9782
6034
10034
16473
3865
19096
6561
11817
10009
14970
16191
16642
11955
15522
13456
16916
3975
6934
11279
7471
16290
12738
15368
20993
559
7385
1614
19981
9773
2255
7320
2769
7013
16860
9113
13734
18756
12746
14538
9321
9109
18013
16218
10404
13443
5858
15474
9108
1485
3204
11467
17947
283
16403
15834
17372
18843
1206
19338
17713
18920
11816
4807
14892
7474
6573
19797
17901
6609
12460
9165
9081
18760
16081
11486
965
13072
16482
16072
20197
17007
18931
12828
14047
20880
12319
7345
6675
20367
17737
14267
2345
15627
7469
14074
20095
12498
14689
15603
21169
12439
15931
18134
14762
2657
21191
20545
16269
5900
91
12549
1113
19292
19427
2299
12910
18478
432
1926
6660
12625
8401
5180
5248
19748
18
20824
14419
14381
14111
16990
921
5458
8400
12342
20871
14043
8655
19661
9346
13716
20994
11809
4189
19571
4018
9255
16247
4054
4523
7414
170
7520
2215
15509
5686
13253
6004
16221
20885
2353
4461
13787
19364
4073
2712
8359
10305
8399
3068
9738
17739
15952
9053
6797
13126
4100
19050
9159
11877
11124
1921
16365
15528
20927
1756
17728
4568
18074
17518
9116
6083
13566
8860
7050
9541
11752
12166
13216
424
19493
5235
14042
10895
21073
16390
3142
10774
12467
8099
9919
6894
17278
9082
16736
6759
14653
8780
14470
6418
17431
15031
15766
1772
1298
2412
20745
3344
14860
17625
5948
13311
17967
18559
18901
8406
16760
540
12084
7260
328
19600
10687
3304
3771
1320
9733
4991
1604
11264
15245
3802
5037
14228
19892
16988
13642
8545
14113
18939
4498
6569
2567
9370
86
20850
8872
17413
9397
17549
12477
18152
12709
8058
18172
14741
3539
14647
9797
4646
12535
13963
3384
5039
548
17806
14809
5184
1002
7695
9331
5021
8321
20484
9924
4609
2792
19510
3774
9047
14144
3366
12689
16432
8486
17511
5335
1787
3800
20949
8825
190
17340
10213
12604
353
20562
3739
14129
348
4962
15485
3293
11930
8166
3077
17555
16933
11769
6370
313
19405
7517
12719
11270
13982
5783
9188
19124
7291
4599
1695
14455
3229
11240
11273
18380
10171
7657
5973
6885
1863
6910
546
4307
5987
6332
9898
5247
735
3359
7504
3254
6215
8291
7784
15805
15988
199
10412
3838
5735
11098
10357
13467
17350
18070
18274
500
19641
14595
13910
15190
18923
12919
17848
5053
15965
6430
19937
637
14224
5923
14141
20779
5394
2311
3190
7540
6782
11850
21007
5455
759
14597
20432
19028
1382
5473
8158
15067
17303
10924
13652
21021
19762
4673
17034
60
76
15383
3709
2360
20699
6730
15369
16047
1739
5891
15794
8849
14179
15530
7842
12894
8702
18791
16689
16436
9114
5295
3036
7614
14800
15232
16442
12684
15059
674
11243
15610
20029
7834
1516
13109
355
13585
21159
18870
17558
13110
10456
16219
8688
15108
14607
15306
12219
18044
1585
16306
2342
12653
11338
11983
3804
17230
11551
11949
18138
129
9382
6515
20457
14774
21
15642
14300
654
19451
7409
21192
5694
16256
6780
11354
1698
1757
12258
5803
19756
8334
4486
11593
4676
2328
7005
11042
9110
6998
8326
7568
12075
7898
8570
7010
5088
17356
14802
10781
13678
184
398
16560
4656
13619
8896
19314
19718
707
4282
20446
18881
17948
5514
18970
1624
2689
3674
21133
18031
2883
8653
14760
11894
19946
12892
5133
8971
12400
12573
17942
8008
18287
14188
18536
9654
1572
6614
10755
21064
10360
14758
9928
7324
20034
2777
8293
20112
1548
16126
14872
2053
5433
16234
13833
4000
9456
14374
1314
9905
20065
510
9429
5382
11048
448
20749
19239
12808
15137
16621
935
2414
8341
5272
8382
14782
12409
15011
14375
515
18325
12293
10935
14611
14766
13773
14682
9769
15088
17747
18533
18856
11052
